%---------------------------------------------------------------
close all;clear;clc;
disp('数值积分，辛普森quad，求f=exp(-0.5*x).*sin(x+pi/6)从0到3pi的积分')
[s,n]=quad('myfesin',0,3*pi) %如提高精度，则调用函数次数将增加
[s,n]=quad('myfesin',0,3*pi,1e-6) %如提高精度，则调用函数次数将增加
[s,n]=quad('myfesin',0,3*pi,1e-9) %如提高精度，则调用函数次数将增加
[s,n]=quad('myfesin',0,3*pi,1e-12) %如提高精度，则调用函数次数将增加

%---------------------------------------------------------------
close all;clear;clc;
disp('数值积分，trapz，求f=exp(-0.5*x)*sin(x+pi/6)从0到3pi的积分')
fun111 = @(x)exp(-0.5*x).*sin(x+pi/6);
x=0:0.1:3*pi;
y=fun111(x);
trapz(x,y) %如提高精度，则调用函数次数将增加

%---------------------------------------------------------------
close all;clear;clc;
disp('数值积分，integral，求f=exp(-0.5*x)*sin(x+pi/6)从0到3pi的积分')
fun111 = @(x)exp(-0.5*x).*sin(x+pi/6);
integral(fun111,0,3*pi) %如提高精度，则调用函数次数将增加


%------------------------------------------------------------
close all;clear;clc;
disp('常微分方程 解析解')
y1=dsolve ('Dy=1+y^2')                 %一簇解
y2=dsolve('Dy=1+y^2','y(0)=1','x')%一个解



%------------------------------------------------------------
close all;clear;clc;
disp('常微分方程组 解析解')
[x,y]=dsolve('Dx=3*x+4*y','Dy=-4*x+3*y', 'x(0)=0,y(0)=1') %一个解
[x,y]=dsolve('Dx=3*x+4*y','Dy=-4*x+3*y') %一簇解



%------------------------------------------------------------
close all;clear;clc;
disp('常系数二阶常微分方程 解析解')
y=dsolve('D2y-2*Dy-3*y=0','y(0)=1,Dy(0)=0','x')



%------------------------------------------------------------
close all;clear;clc;
disp('二阶常微分方程 无解析解，注意看命令窗口的提示信息')
y=dsolve('D2x-(1-x^2)*Dx+x=0', ' x(0)=3,Dx(0)=0')



%------------------------------------------------------------
close all;clear;clc;
disp('非线性常微分方程')
x=dsolve('(Dx)^2+x^2-1', 'x(0)=0')




%------------------------------------------------------------
close all;clear;clc;
disp('常微分方程  计算数值解  y'= - y+x+1, y(0) = 1')
[x, y]=ode23('weif', [0, 1], 1)
plot(x, y, 'ro');
hold  on  
ezplot('x+exp(-x)',[0, 1]) %对比精确解,该问题有精确解,图中实线是精确解，圆圈是数值解



%------------------------------------------------------------
close all;clear;clc;
disp('常微分方程 数值解 Van der pol 方程')
[t,y]=ode23('vdpol',[0,20],[3,0]);
y1=y(:,1);    %  原方程的解记为y1
y2=y(:,2);    %  y1的导数极为y2
plot(t,y1,t,y2,'--')      %    y1(t),y2(t) 曲线图 
plot(y1,y2),grid, %  相轨迹图，即y2(y1)曲线




%------------------------------------------------------------
close all;clear;clc;
disp('常微分方程 数值解 Lorenz方程')
x0=[0 0 0.1]';
[t,x]=ode45('lorenz',[0,10],x0);
plot(t,x(:,1),'-',t,x(:,2),'*',t,x(:,3),'+')
plot3(x(:,1),x(:,2),x(:,3)),grid on



%------------------------------------------------------------
close all;clear;clc;
disp('数值微分的间接计算（diff 或者插值，拟合）')
f=inline('sqrt(x.^3+2*x.^2-x+12)+(x+5).^(1/6)+5*x+2');
g=inline('(3*x.^2+4*x-1)./sqrt(x.^3+2*x.^2-x+12)/2+1/6./(x+5).^(5/6)+5');
x=-3:0.01:3;
p=polyfit(x,f(x),5);      %用5次多项式p拟合f(x)
dp=polyder(p);              %对拟合多项式p求导数dp
dpx=polyval(dp,x);          %求dp在假设点的函数值
dx=diff(f([x,3.01]))/0.01;   %直接对f(x)求数值导数
gx=g(x);       %求函数f的导函数g在假设点的导数
plot(x,dpx,x,dx,'.',x,gx,'-');   %作图



