clear all
ma = linspace(0,1,50);   %马赫数
Swly = 47.64;      %外露翼面积
Sjy = 42.99;       %机翼面积
Sjrs = 50.51;      %机身浸润面积
Ssh = 1.47;        %机身截面积
Swy = 11.038;      %尾翼面积

%计算厚度修正系数
c = [0.1556 0.12];  %相对厚度
xc = [0.37 0.309];  %相对厚度位置
xm = [5 10]/360*pi; %后掠角
cxm = cos(xm);      %后掠角余弦
yt1 = 1+0.6./xc.*c+100*c.^4;
yt21 = 1.34.*(ma.^1.8)*(cxm(1).^0.28);
yt22 = 1.34.*(ma.^1.8)*(cxm(2).^0.28);
yt11 = yt1(1).*yt21;  %机翼
yt12 = 1.1428;        %机身
yt13 = yt1(2).*yt22;  %尾翼

%计算表面摩擦系数
p0 = 1.225;     %海平面空气密度
t0 = 288.15;    %海平面气温
v = 340;        %海平面声速
h = [0 5 11];   %三个高度
h2 = 20000;     %20千米
T = t0-6.5.*h;  %三个高度下开氏温度
T2 = 216.65;    %20千米开氏温度
t = T - 273;    %三个高度下摄氏温度
t2 = T2 - 273;  %20千米摄氏温度
P = p0.*(T./t0).^4.25588;    %三个高度下空气密度
P2 = 0.36392*exp((-h2+11000)/6341.62);   %20千米空气密度
V = 331.13 + 0.606.*t;       %三个高度下声速
V2 = 331.13 + 0.606.*t2;     %20千米声速
d = [1.3916 1.37 1.5];       %机翼、机身、尾翼特征长度
yt = 1.8*10^(-5);            %空气粘性系数   
v1 = V(1).*ma;         %海平面速度
v2 = V(2).*ma;         %5千米速度
v3 = V(3).*ma;         %11千米速度
v4 = V2.*ma;           %20千米速度
r11 = P(1).*v1*d(1)/yt;   %海平面机翼雷诺数
r12 = P(1).*v1*d(2)/yt;   %海平面机身雷诺数
r13 = P(1).*v1*d(3)/yt;   %海平面尾翼雷诺数
r21 = P(2).*v2*d(1)/yt;   %5千米机翼雷诺数
r22 = P(2).*v2*d(2)/yt;   %5千米机身雷诺数
r23 = P(2).*v2*d(3)/yt;   %5千米尾翼雷诺数
r31 = P(3).*v3*d(1)/yt;   %11千米机翼雷诺数
r32 = P(3).*v3*d(2)/yt;   %11千米机身雷诺数
r33 = P(3).*v3*d(3)/yt;   %11千米尾翼雷诺数
r41 = P2*v4*d(1)/yt;      %20千米机翼雷诺数
r42 = P2*v4*d(2)/yt;      %20千米机身雷诺数
r43 = P2*v4*d(3)/yt;      %20千米尾翼雷诺数
cf11 = 0.455./log10(r11).^2.58;   %海平面机翼表面摩擦系数
cf12 = 0.455./log10(r12).^2.58;   %海平面机身表面摩擦系数
cf13 = 0.455./log10(r13).^2.58;   %海平面尾翼表面摩擦系数
cf21 = 0.455./log10(r21).^2.58;   %5千米机翼表面摩擦系数
cf22 = 0.455./log10(r22).^2.58;   %5千米机身表面摩擦系数
cf23 = 0.455./log10(r23).^2.58;   %5千米尾翼表面摩擦系数
cf31 = 0.455./log10(r31).^2.58;   %11千米机翼表面摩擦系数
cf32 = 0.455./log10(r32).^2.58;   %11千米机身表面摩擦系数
cf33 = 0.455./log10(r33).^2.58;   %11千米尾翼表面摩擦系数
cf41 = 0.455./log10(r41).^2.58;   %20千米机翼表面摩擦系数
cf42 = 0.455./log10(r42).^2.58;   %20千米机身表面摩擦系数
cf43 = 0.455./log10(r43).^2.58;   %20千米尾翼表面摩擦系数

%计算全机摩擦阻力系数
cd0y11 = 2*cf11.*yt11.*Swly;   %海平面机翼摩擦阻力系数
cd0y12 = cf12.*yt12.*Sjrs;     %海平面机身摩擦阻力系数
cd0y13 = 2*cf13.*yt13.*Swy;    %海平面尾翼摩擦阻力系数
cd0y1 = (cd0y11+cd0y12+cd0y13)./Sjy;  %海平面全机摩擦阻力系数
cd0y21 = 2*cf21.*yt11.*Swly;   %5千米机翼摩擦阻力系数
cd0y22 = cf22.*yt12.*Sjrs;     %5千米机身摩擦阻力系数
cd0y23 = 2*cf23.*yt13.*Swy;    %5千米尾翼摩擦阻力系数
cd0y2 = (cd0y21+cd0y22+cd0y23)./Sjy;  %5千米全机摩擦阻力系数
cd0y31 = 2*cf31.*yt11.*Swly;   %11千米机翼摩擦阻力系数
cd0y32 = cf32.*yt12.*Sjrs;     %11千米机身摩擦阻力系数
cd0y33 = 2*cf33.*yt13.*Swy;    %11千米尾翼摩擦阻力系数
cd0y3 = (cd0y31+cd0y32+cd0y33)./Sjy;  %11千米全机摩擦阻力系数
cd0y41 = 2*cf41.*yt11.*Swly;   %20千米机翼摩擦阻力系数
cd0y42 = cf42.*yt12.*Sjrs;     %20千米机身摩擦阻力系数
cd0y43 = 2*cf43.*yt13.*Swy;    %20千米尾翼摩擦阻力系数
cd0y4 = (cd0y41+cd0y42+cd0y43)./Sjy;  %20千米全机摩擦阻力系数

%计算压差阻力系数
cdt = -0.03;    %头部阻力系数
dertc = 0.008;  %附加阻力系数
cd0y = (cdt+dertc)*Ssh/Sjy;   %压差阻力系数

%计算零升阻力
cd1 = 1.1.*(cd0y1+cd0y);     %海平面零升阻力
cd2 = 1.1.*(cd0y2+cd0y);     %5千米零升阻力
cd3 = 1.1.*(cd0y3+cd0y);     %11千米零升阻力
cd4 = 1.1.*(cd0y4+cd0y);     %11千米零升阻力

%作图：零升阻力——马赫数
plot(ma,cd1,ma,cd2,ma,cd3,ma,cd4);
legend('海平面','5千米','11千米','20千米');
ginput();


